#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Правило = Список.УсловноеОформление.Элементы.Добавить();
    Правило.Использование = Истина;

    Правило.Оформление.УстановитьЗначениеПараметра(
        "ЦветТекста", WebЦвета.Красный);

    Условие = Правило.Отбор.Элементы.Добавить(
        Тип("ЭлементОтбораКомпоновкиДанных"));

    Условие.Использование = Истина;
    Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
    Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    //@skip-check use-non-recommended-method
    Условие.ПравоеЗначение = ТекущаяДата() - 30 * 24 * 60 * 60;

КонецПроцедуры
#КонецОбласти